package javabasis.collection;

import java.util.HashMap;

/**
 * Created by Edwin Xu on 7/25/2020 7:15 PM
 *
 *
 *
 * 志愿填报：
 * --》比较往年分数段
 * --》候选大学
 * --》看专业(是否合胃口，专业是否优秀)，排除一部分大学
 * --》比较城市
 *      -- 省内：同学比较多，离家近，压力相对小，生活比较方便
 *      -- 省外：主要考虑稍大一点的城市，机会多，有更多的活力，压力相对大。
 * --》得出最终的几个候选大学和专业
 * --》找这几个大学的在校生了解该校该专业的情况(很重要，不然也容易入坑。去问下那
 *     些在校生，他们对自己所在专业的评价)
 * --》得出123志愿：
 *    - 1：可以冲一下，（好像有专业调剂，要注意）
 *    - 2：稳
 *    - 3：备选项。。。
 *
 *
 *
 */
public class HashMap_ {

    public static void main(String[] args) {
//        HashMap

    }
}
